
## Plan Result (stg)




<pre><code>Plan: 15 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-client-id&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-client-id-dev&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-client-secret&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-client-secret-dev&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-config-endpoint&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-admin-ctsc&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-admin-ctsc-dev&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-admin-local&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-admin-local-dev&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-super-admin-ctsc&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-super-admin-ctsc-dev&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-super-admin-local&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-super-admin-local-dev&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-system-admin&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;sso-sg-system-admin-dev&#34;]
* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_runbook.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.redis-v6.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (10 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                     = "CaTH-Group"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_runbook.client_serects will be updated in-place
  ~ resource "azurerm_automation_runbook" "client_serects" {
      ~ content                  = <<-EOT
            Param(
              [string]$source_client_id,
              [string]$source_tenant_id,
            
              [string]$target_tenant_id,
              [string]$target_application_id,
              [string]$target_application_secret,
            
              [array]$application_id_collection,
            
              [string]$environment,
              [string]$product,
              [string]$prefix,
            
          -   [string]$key_vault_name 
          +   [string]$key_vault_name
            )
            
            $application_id_collection_arr = $application_id_collection.Split(',')
            if ($application_id_collection_arr.length -lt 1) {
          -   Write-Warning "No Applications to process. $application_id_collection"; 
          +   Write-Warning "No Applications to process. $application_id_collection";
              exit
            }
            else {
          -   Write-Output "there is Applications to process. $application_id_collection"; 
          +   Write-Output "there is Applications to process. $application_id_collection";
            }
            
            #############################################################
            ###           Get Current Context                      ###
            #############################################################
            
            # Ensures you do not inherit an AzContext in your runbook
            Disable-AzContextAutosave -Scope Process | Out-Null
          -  
          + 
            # Connect using a Managed Service Identity
            try {
              $sourceContext = (Connect-AzAccount -Identity -TenantId $source_tenant_id -AccountId $source_client_id ).context
            }
            catch {
          -   Write-Error "Cannot connect to the source Managed Identity $source_client_id in $source_tenant_id. Aborting."; 
          +   Write-Error "Cannot connect to the source Managed Identity $source_client_id in $source_tenant_id. Aborting.";
              exit
            }
            
            #############################################################
            ###           Set Target Context                          ###
            #############################################################
            
            if ($null -eq $target_tenant_id -or $target_tenant_id -eq "") {
            
              $targetContext = $sourceContext
            }
            else {
              # Connect to target Tenant
              try {
                $password = ConvertTo-SecureString $target_application_secret -AsPlainText -Force
                $Credential = New-Object -TypeName System.Management.Automation.PSCredential ($target_application_id, $password)
                $targetContext = (Connect-AzAccount -ServicePrincipal -TenantId $target_tenant_id -Credential $Credential).context
              }
              catch {
          -     Write-Error "Failed to connect remote tenant. Error: $($_)"; 
          +     Write-Error "Failed to connect remote tenant. Error: $($_)";
                exit
              }
            }
            
            $targetContext = Set-AzContext -Context $targetContext
            
            #############################################################
            ###           Common Functions                           ###
            #############################################################
            
            function GeneratePassword {
              function Get-RandomCharacters($length, $characters) {
                $random = 1..$length | ForEach-Object { Get-Random -Maximum $characters.length }
                $private:ofs = ""
                return [String]$characters[$random]
              }
          -  
          -   function ScrambleString([string]$inputString) {     
          -     $characterArray = $inputString.ToCharArray()   
          -     $scrambledStringArray = $characterArray | Get-Random -Count $characterArray.Length     
          + 
          +   function ScrambleString([string]$inputString) {
          +     $characterArray = $inputString.ToCharArray()
          +     $scrambledStringArray = $characterArray | Get-Random -Count $characterArray.Length
                $outputString = -join $scrambledStringArray
          -     return $outputString 
          +     return $outputString
              }
          -  
          + 
              $password = Get-RandomCharacters -length 5 -characters 'abcdefghiklmnoprstuvwxyz'
              $password += Get-RandomCharacters -length 1 -characters 'ABCDEFGHKLMNOPRSTUVWXYZ'
              $password += Get-RandomCharacters -length 1 -characters '1234567890'
              $password += Get-RandomCharacters -length 1 -characters '!"§$%&/()=?}][{@#*+'
          -  
          + 
              $password = ScrambleString $password
            
              return $password
            }
            
            #############################################################
            ###           Process Applications                        ###
            #############################################################
            try {
              $Applications = Get-AzADApplication -DefaultProfile $targetContext
              Write-Output "Applications Found:"
              foreach ($app in $Applications) {
                Write-Output "$($app.DisplayName) - $($app.Id)"
              }
            
              $expiringRangeDays = 30
          -   $expiryFromNowYears = 1
          +   $expiryFromNowMonths = 13
            
              Write-Output "Start Processing"
              foreach ($application_id in $application_id_collection_arr) {
          -   
          + 
                Write-Output "Starting $application_id"
                $containsApp = $Applications.Id -contains $application_id
            
                Write-Output "Contained?  $containsApp"
                if ($containsApp) {
            
                  try {
                    $app = $Applications | Where-Object { $_.Id -eq $application_id }
            
                    $appName = $app.DisplayName
                    $objectId = $app.Id
                    $appId = $app.AppId.ToString()
                    Write-Output "Got App $appName"
            
                    $secrets = Get-AzADAppCredential -ObjectId $objectId -DefaultProfile $targetContext
                    Write-Output "Got $($secrets.length) Secrets in Total"
            
                    $kvSecretName = "$prefix-$product-$environment-$appName"
          -         $secretStartDate = Get-Date 
          -         $secretEndDate = $secretStartDate.AddYears($expiryFromNowYears) 
          +         $secretStartDate = Get-Date
          +         $secretEndDate = $secretStartDate.AddMonths($expiryFromNowMonths)
                    $displayNamePrefix = "$prefix-pwd"
                    $displayName = "$displayNamePrefix-$($(Get-Date).ToString('yyyyMMddhhmmss'))"
          -   
          + 
                    Write-Output "Checking $appName has automated secrets"
            
                    $filteredSecrets = $($secrets | Where-Object { $_.DisplayName -like "$displayNamePrefix*" })
                    $secretCount = $filteredSecrets.length
                    $secretExists = ($secretCount -gt 0 -and $null -ne $secrets)
                    Write-Output "Length: $secretCount"
                    Write-Output "Auto Secret Exits? $secretExists"
          -   
          + 
                    if (!$secretExists) {
                      Write-Output "Creating Secret $kvSecretName"
                      $passCreds = [PSCustomObject]@{
                        DisplayName = $displayName
                        EndDateTime = $secretEndDate
                        StartDateTime = $secretStartDate
                      }
                      $response = New-AzADAppCredential -ObjectId $objectId -PasswordCredentials $passCreds -DefaultProfile $targetContext
            
          -           ## Add/Update Secret 
          +           ## Add/Update Secrets
                      Write-Output "Saving Secret to $key_vault_name"
                      $secretvalue = ConvertTo-SecureString $response.secretText -AsPlainText -Force
                      Set-AzKeyVaultSecret -VaultName $key_vault_name -Name "$kvSecretName-pwd" -SecretValue $secretvalue -DefaultProfile $sourceContext
          + 
          +           Write-Output "Saving ID to $key_vault_name"
          +           $secretvalueId = ConvertTo-SecureString $appId -AsPlainText -Force
          +           Set-AzKeyVaultSecret -VaultName $key_vault_name -Name "$kvSecretName-id" -SecretValue $secretvalueId -DefaultProfile $sourceContext
                    }
                    else {
            
                      Write-Output "Recycling $appName Secrets STARTED"
          -           
          + 
                      $validSecrets = $false
                      foreach ($s in $filteredSecrets) {
          -             $keyName = $s.DisplayName 
          +             $keyName = $s.DisplayName
                        Write-Output "Secret: $keyName"
                        $keyId = $s.KeyId
                        Write-Output "$appName Secret $keyName"
          -   
          + 
                        $endDate = Get-Date($s.EndDateTime)
            
                        $currentDate = Get-Date
                        $expiringRangeDate = $(Get-Date).AddDays($expiringRangeDays)
            
                        $endDateObj = ($endDate - $currentDate)
                        $expiringRangeDateObj = ($endDate - $currentDate)
            
                        Write-Output "$keyName has expires $endDate. It has $($endDateObj.Days) days"
                        Write-Output "Expiry Date Range is $expiringRangeDate. It has $($expiringRangeDateObj.Days) day"
                        if ($endDateObj.Days -lt 1) {
                          Write-Output "$keyName has expired ($endDate). Removing Key"
                          Remove-AzADAppCredential -ObjectId $objectId -KeyId $keyId -DefaultProfile $targetContext
                        }
                        elseif ($expiringRangeDateObj.Days -lt $expiringRangeDays) {
          -               Write-Output "$keyName will expire within $expiringRangeDays."           
          +               Write-Output "$keyName will expire within $expiringRangeDays."
                        }
                        else {
                          Write-Output "$kvSecretName secret is not expiring"
                          $validSecrets = $true
                        }
          -            
          + 
                      }
            
                      if (!$validSecrets) {
                        Write-Output "There are no valid secrets"
          -     
          + 
                        Write-Output "Creating Secret $kvSecretName"
                        $passCreds = [PSCustomObject]@{
                          DisplayName = $displayName
                          EndDateTime = $secretEndDate
                          StartDateTime = $secretStartDate
                        }
                        $response = New-AzADAppCredential -ObjectId $objectId -PasswordCredentials $passCreds -DefaultProfile $targetContext
          -     
          -             ## Add/Update Secret 
          + 
          +             ## Add/Update Secrets
                        $secretvalue = ConvertTo-SecureString $response.secretText -AsPlainText -Force
                        Set-AzKeyVaultSecret -VaultName $key_vault_name -Name "$kvSecretName-pwd" -SecretValue $secretvalue -DefaultProfile $sourceContext
          + 
          +             Write-Output "Saving ID to $key_vault_name"
          +             $secretvalueId = ConvertTo-SecureString $appId -AsPlainText -Force
          +             Set-AzKeyVaultSecret -VaultName $key_vault_name -Name "$kvSecretName-id" -SecretValue $secretvalueId -DefaultProfile $sourceContext
                      }
            
                      Write-Output "Recycling $appName Secrets ENDED"
                    }
            
          -         Write-Output "Saving ID to $key_vault_name"
          -         $secretvalue = ConvertTo-SecureString $appId -AsPlainText -Force
          -         Set-AzKeyVaultSecret -VaultName $key_vault_name -Name "$kvSecretName-id" -SecretValue $secretvalue -DefaultProfile $sourceContext
                  }
                  catch {
          -         Write-Error "Failed to update secret: $application_id. Aborting."; 
          -         Write-Error "Error: $($_)"; 
          +         Write-Error "Failed to update secret: $application_id. Aborting.";
          +         Write-Error "Error: $($_)";
                    exit
                  }
          -     
          + 
                  Write-Output "Ending $application_id"
                }
                else {
                  Write-Warning "$application_id is not found in the Application Collection."
                }
                Write-Output "Nexted"
              }
              Write-Output "End Processing"
            
            }
            catch {
          -   Write-Error "Failed to process secrets. Aborting."; 
          -   Write-Error "Error: $($_)"; 
          +   Write-Error "Failed to process secrets. Aborting.";
          +   Write-Error "Error: $($_)";
              exit
            }
            
            Write-Output "Completed"
        EOT
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/runbooks/secret-rotation-b2c-apps"
        name                     = "secret-rotation-b2c-apps"
        tags                     = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-10-11T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-10-10T14:42:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-client-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-client-id-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-client-id-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-client-secret"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-client-secret-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-client-secret-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-config-endpoint"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-config-endpoint"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-admin-ctsc"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-admin-ctsc"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-admin-ctsc-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-admin-ctsc-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-admin-local"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-admin-local"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-admin-local-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-admin-local-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-super-admin-ctsc"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-super-admin-ctsc"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-super-admin-ctsc-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-super-admin-ctsc-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-super-admin-local"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-super-admin-local"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-super-admin-local-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-super-admin-local-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-system-admin"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-system-admin"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["sso-sg-system-admin-dev"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2025-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "sso-sg-system-admin-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.redis-v6.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg/providers/Microsoft.Cache/redis/pip-v6-stg"
        name                          = "pip-v6-stg"
        tags                          = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 200
          ~ maxmemory_delta                         = 125 -> 200
          ~ maxmemory_reserved                      = 125 -> 200
            # (14 unchanged attributes hidden)
        }
    }

Plan: 15 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":193,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->